#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.master: Refreshing state... [id=none]
random_pet.secret_name: Refreshing state... [id=strangely-steady-monkfish]
module.email_response_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_region.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.transcription_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.resume_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.attachment_saver.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.email_request_preprocessor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-email-request-preprocessor-dev]
module.memory.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-memory-dev]
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.attachment_saver.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_request_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.resume.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.resume.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.transcription_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.resume_request_preprocessor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-resume-request-preprocessor-dev]
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.resume_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_response_processor.module.fifo_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-response-processor-queue-dev.fifo]
module.lex_router.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-lex-router-dev]
module.email_request_processor.module.fifo_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-request-processor-queue-dev.fifo]
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.resume.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.attachment_saver.data.aws_caller_identity.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.transcription_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-transcription-processor-dev]
module.resume.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.transcription_processor.data.aws_ecr_image.lambda_image: Reading...
module.attachment_saver.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.attachment_saver.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.attachment_saver.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.attachment_saver.module.lambda_function_container_image.data.aws_region.current: Reading...
module.attachment_saver.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
module.resume_request_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-resume-request-processor-dev]
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage-dev]
module.resume.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-resume-dev]
module.resume.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.integration_base.data.aws_caller_identity.current: Reading...
module.resume.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3806204806]
module.email_response_processor.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.attachment_saver.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-attachment-saver-dev]
module.list_collections.module.integration_base.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_response_processor.data.aws_ecr_image.lambda_image: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.email_response_processor.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.resume.data.aws_ecr_image.lambda_image: Reading...
module.email_response_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-email-response-processor-dev]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.resume_request_processor.data.aws_ecr_image.lambda_image: Reading...
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
aws_api_gateway_rest_api.this: Refreshing state... [id=d09uj3e9kh]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.data.aws_ecr_image.lambda_image: Reading...
module.email_request_preprocessor.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3277652423]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.email_request_preprocessor.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00fb300ee2d2f7b3b]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-inference-dev]
data.aws_cognito_user_pools.api_cognito: Reading...
module.resume.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:585efa84b5f4dc9082a7fb997f40c867a33ac9fd7ce256505643d40cdfd36687]
module.resume_request_preprocessor.data.aws_caller_identity.current: Reading...
module.resume_request_preprocessor.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.list_collections.data.aws_ecr_image.lambda_image: Reading...
module.email_response_processor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:b85d9ebf42475aca36ff7c88f542aecf612d3993d6db5fda824ee361bfeb6789]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_response_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.transcription_processor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:0a4a065d4bc630fd55ebfe1049f72a267d538c02d6282b65af9338bac2f5ffb3]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.resume.data.aws_caller_identity.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.resume.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_cognito_user_pools.api_cognito: Read complete after 0s [id=estaec814cb7e6_userpool_814cb7e6-dev]
module.email_request_processor.data.aws_ecr_image.lambda_image: Reading...
module.resume_request_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.resume_request_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.memory.module.lambda_function_container_image.data.aws_region.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_ses_receipt_rule_set.main_rule_set: Refreshing state... [id=levio-demo-fev-esta-rule-set-dev]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.attachment_saver.data.aws_ecr_image.lambda_image: Reading...
module.inference.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:ea744cb2e91a9188cb61957ffd76a7f2942aaef81e05333cc23efe8c73cbb95f]
module.transcription_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.transcription_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=734877482]
module.inference.module.integration_base.data.aws_caller_identity.current: Reading...
module.resume_request_processor.data.aws_caller_identity.current: Reading...
module.inference.module.integration_base.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.integration_cognito.data.aws_caller_identity.current: Reading...
module.resume_request_processor.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.inference.module.integration_cognito.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
data.aws_availability_zones.available: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.transcription_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.transcription_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.resume_request_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.resume_request_processor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:22f4583dc63dd50b3ae4234438fe8ce11e1a28593f49440f6e5c20b624c2298f]
module.resume_request_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_request_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.ingestion.data.aws_ecr_image.lambda_image: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.list_collections.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-list-collections-dev]
data.aws_ami.latest_amazon_linux: Reading...
module.email_request_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-email-request-processor-dev]
module.attachment_saver.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:2328f70c6cbb5387283570a62b648ee46cace16f49be8e03c7a73955a99f90eb]
aws_iam_role.this: Refreshing state... [id=levio-demo-fev-api-role]
module.email_response_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.resume.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.resume.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.aws_dynamodb_table.basic-conversation_memory_table-table: Refreshing state... [id=levio-demo-fev-chat-history-dev]
module.list_collections.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:48ac111f59ee85c678a2fefa71a5401163727a9b9b8c569973307be2f5d51dd4]
module.resume.module.lambda_function_container_image.data.aws_region.current: Reading...
module.resume.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.memory.data.aws_ecr_image.lambda_image: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=levio-demo-fev-esta-ses-bucket-dev]
module.email_request_processor.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:c2cd976cf49036766b5e2f879827f47234dbe574ea94311a8bdf2f0e508a648f]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.attachment_saver.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.attachment_saver.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
aws_api_gateway_api_key.this: Refreshing state... [id=mwfvag0h0f]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.resume_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.resume_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.resume_request_preprocessor.data.aws_ecr_image.lambda_image: Reading...
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev_dead_letter]
module.ingestion.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:5c7e4ac3734152e6270cd29eb1c623dd2c601589c62b74098cb5549ec8c2536c]
module.s3_bucket.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1348983281]
module.email_request_preprocessor.data.aws_ecr_image.lambda_image: Reading...
module.lex_router.data.aws_ecr_image.lambda_image: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.transcription_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.transcription_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion-dev]
module.memory.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:64d944cb689926e9bf269bb2710778a7daf0dfd247313158f1c02567aa589a37]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.transcription_processor.data.aws_caller_identity.current: Reading...
module.transcription_processor.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.resume.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-resume-dev-role]
module.resume_request_preprocessor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:37023604466b619df3221f0e90e9b33583b374c99bfe9ee15a61d86bc2fdb864]
module.resume_request_preprocessor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-resume-request-preprocessor-dev-role]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role]
module.email_request_preprocessor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:2b07592a75c0ad774d1840c607054bf0ee06e92d1dd1a9a66d3c3c1b92bb70ea]
module.attachment_saver.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-attachment-saver-dev-role]
module.lex_router.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:036958f9227b10509708f65e8056563d75c5dd8674aafd2670a74d79bdb60a56]
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|terraform-20240126151709956800000002]
data.aws_secretsmanager_secret.password: Reading...
module.resume.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-resume-dev-role-inline]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role]
module.memory.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role]
module.lex_router.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role]
module.memory.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-inline]
module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role]
data.aws_ami.latest_amazon_linux: Read complete after 1s [id=ami-0bef12ee7bc073414]
aws_api_gateway_authorizer.this: Refreshing state... [id=p9hrwu]
module.transcription_processor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-transcription-processor-dev-role]
aws_ses_active_receipt_rule_set.active_main_rule_set: Refreshing state... [id=levio-demo-fev-esta-rule-set-dev]
module.list_collections.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role]
module.resume_request_processor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-resume-request-processor-dev-role]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-inline]
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.email_request_preprocessor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-email-request-preprocessor-dev-role]
aws_api_gateway_account.this: Refreshing state... [id=api-gateway-account]
aws_iam_role_policy.this: Refreshing state... [id=levio-demo-fev-api-role:this]
data.aws_secretsmanager_secret_version.password: Reading...
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=levio-demo-fev-esta-ses-bucket-dev]
module.resume.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-resume-dev-role-20240315153609012400000003]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1473281441]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3522429600]
module.transcription_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.transcription_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3305079781]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710029800000004]
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|AWSCURRENT]
module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=878917428]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b9066ddfe118437e]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7ddd92ffe7cad50]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1366123725]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-086b3e733d88fa370]
module.resume_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.resume_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1868821589]
module.attachment_saver.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3953744684]
module.resume.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.resume.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1777618339]
data.aws_iam_policy_document.allow_access_from_ses: Reading...
module.attachment_saver.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2353498002]
data.aws_iam_policy_document.allow_access_from_ses: Read complete after 0s [id=1118948238]
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3325663242]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2926739739]
module.inference.module.integration_cognito.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=uvd5hn]
module.list_collections.module.integration_base.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=4z02sq]
module.inference.module.integration_base.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=nw7wpk]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=736838273]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2314128230]
module.email_request_preprocessor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-preprocessor-dev-role-logs]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.transcription_processor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-transcription-processor-dev-role-logs]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=52771042]
module.memory.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-logs]
module.resume_request_preprocessor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-resume-request-preprocessor-dev-role-logs]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-0902cb6d437a968b6]
aws_security_group.sm_sg: Refreshing state... [id=sg-013ee0bdd16b8366f]
aws_security_group.lambda_egress_all_sg: Refreshing state... [id=sg-054f9a76901acf353]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0b9900b5db426c576]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512646400000001]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-logs]
module.resume_request_processor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-resume-request-processor-dev-role-logs]
module.resume.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-resume-dev-role-logs]
module.attachment_saver.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-attachment-saver-dev-role-logs]
module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-logs]
module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-response-processor-dev-role-logs]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-logs]
module.email_request_processor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-processor-dev-role-logs]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-logs]
module.inference.module.integration_cognito.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-uvd5hn-GET]
module.inference.module.integration_base.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-nw7wpk-GET]
module.list_collections.module.integration_base.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-4z02sq-GET]
module.email_request_preprocessor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-email-request-preprocessor-dev-role-20240229152012792300000001]
module.resume_request_preprocessor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-resume-request-preprocessor-dev-role-20240315153609423400000008]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710095500000006]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2734712511]
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.email_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=541121536]
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2782980661]
module.transcription_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-transcription-processor-dev-role-20240315153609144300000005]
module.attachment_saver.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.s3_bucket.data.aws_iam_policy_document.combined[0]: Reading...
module.s3_bucket.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=1118948238]
module.attachment_saver.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=138245272]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02f9981846a152b24]
module.transcription_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04aae6346ab85dfe5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbe5e0845bba1093]
module.transcription_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2051429475]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09be498e3f465bbb5]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-20240126151710029200000003]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0d1f5f95132e695a6]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-03f5acb4bc8b5d586]
module.resume_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-resume-request-processor-dev-role-20240315153609281300000007]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-uvd5hn-OPTIONS]
module.inference.module.integration_base.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-nw7wpk-OPTIONS]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-4z02sq-OPTIONS]
module.attachment_saver.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-attachment-saver-dev-role-20240315153609019100000004]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512785600000002]
module.resume.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-resume-dev-role-20240315153609278700000006]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role-20240221194307124300000002]
aws_security_group.database_sg: Refreshing state... [id=sg-02511ace313a817bd]
aws_security_group.dynamo_db_sg: Refreshing state... [id=sg-0c6d3637458aa4799]
module.email_request_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-processor-dev-role-inline]
module.email_request_preprocessor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-preprocessor-dev-role-inline]
module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-response-processor-dev-role-inline]
module.s3_bucket.aws_s3_bucket_policy.this[0]: Refreshing state... [id=levio-demo-fev-esta-ses-bucket-dev]
module.attachment_saver.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-attachment-saver-dev-role-inline]
module.inference.module.integration_base.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev-inference-GET]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240130201651725000000001]
module.transcription_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-transcription-processor-dev-role-inline]
module.list_collections.module.integration_base.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-list-collections-dev-collections-GET]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-00ef44a2d775aaa99]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0f03a46a772c6a571]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role-20240221194307033600000001]
module.inference.module.integration_cognito.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev-inferencecog-GET]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-20240126151710031000000005]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-uvd5hn-OPTIONS-200]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-uvd5hn-OPTIONS]
module.inference.module.integration_base.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-nw7wpk-OPTIONS]
module.inference.module.integration_base.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-nw7wpk-OPTIONS-200]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-4z02sq-OPTIONS-200]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-4z02sq-OPTIONS]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02f9981846a152b241080289494]
module.resume.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-resume-dev]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform-dev]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db0a8005c04ca4f2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-066d9aa6005ec7c94]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role-20240221194332764500000004]
module.email_request_preprocessor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-email-request-preprocessor-dev-role-20240229152014073200000002]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role-20240221194332717000000003]
module.s3_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=levio-demo-fev-esta-ses-bucket-dev]
module.attachment_saver.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-attachment-saver-dev-role-20240315153608577100000002]
module.transcription_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-transcription-processor-dev-role-20240315153609545100000009]
module.inference.module.integration_cognito.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-uvd5hn-OPTIONS-200]
aws_vpc_endpoint.lambda_endpoint: Refreshing state... [id=vpce-0b1660c4cfd3c329e]
aws_instance.jumpbox: Refreshing state... [id=i-0d6cf11202b320401]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-07b8182fd57a40bc7]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0a8ed6effde8d7daf]
module.list_collections.module.integration_base.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-4z02sq-OPTIONS-200]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-044bfd1713e1c30ec]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0d7135c7f623e06f8]
module.inference.module.integration_base.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-nw7wpk-OPTIONS-200]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-0fdf03f021658d47f]
aws_vpc_endpoint.dynamo_db_endpoint: Refreshing state... [id=vpce-04b83095daf470dae]
module.email_request_preprocessor.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-email-request-preprocessor-dev]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev]
module.attachment_saver.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-attachment-saver-dev]
module.transcription_processor.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-transcription-processor-dev]
module.attachment_saver.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["s3"]: Refreshing state... [id=s3]
module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev]
module.memory.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-memory-dev]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"]: Refreshing state... [id=sqs]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"]: Refreshing state... [id=6372d997-1ffe-4d2e-b58c-8870ba706c3d]
module.email_request_preprocessor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["ses"]: Refreshing state... [id=ses]
aws_db_instance.vector_db: Refreshing state... [id=db-KTG3TDKXH3C3BOXFTTIFJ5SASY]
module.transcription_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["s3"]: Refreshing state... [id=s3]
aws_ses_receipt_rule.chat_rule: Refreshing state... [id=levio-demo-fev-esta-chat-rule-dev]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1333636943]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2560015702]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=242001761]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-inline]
module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-inline]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240202005532784400000004]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-2024012615222187350000000e]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-2024012615222186470000000d]
module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev]
module.inference.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-inference-dev]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev]
module.inference.module.integration_cognito.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-uvd5hn-GET]
module.inference.module.integration_base.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-nw7wpk-GET]
module.list_collections.module.integration_base.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-4z02sq-GET]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=ffdd3b10-6ac6-4fbf-bbd1-a7e6e82bf9d1]
aws_api_gateway_deployment.this: Refreshing state... [id=bm6zna]
aws_api_gateway_stage.this: Refreshing state... [id=ags-d09uj3e9kh-dev]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage-dev]
aws_api_gateway_usage_plan.this: Refreshing state... [id=jxe0z0]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev]
aws_api_gateway_usage_plan_key.this: Refreshing state... [id=mwfvag0h0f]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"]: Refreshing state... [id=sqs]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"]: Refreshing state... [id=f9630eab-ef3d-41c7-bd22-d541cb86d9a8]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.attachment_saver.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-attachment-saver-dev"
      ~ last_modified                  = "2024-03-15T15:36:17.473+0000" -> "2024-03-15T15:36:36.872+0000"
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.transcription_processor.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-transcription-processor-dev"
      ~ last_modified                  = "2024-03-15T15:36:17.733+0000" -> "2024-03-15T15:36:30.874+0000"
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2024-03-15T15:36:38Z" -> (known after apply)
      ~ description   = "Deployment for 2024-03-15T15:36:38Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> (known after apply)
      ~ id            = "bm6zna" -> (known after apply)
      ~ invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "2024-03-15T15:36:38Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "bm6zna" -> (known after apply)
        id                    = "ags-d09uj3e9kh-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_s3_bucket_notification.bucket_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket      = "levio-demo-fev-esta-ses-bucket-dev"
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "resume/attachment/"
          + id                  = (known after apply)
          + lambda_function_arn = "arn:aws:lambda:us-east-1:446872271111:function:levio-demo-fev-transcription-processor-dev"
        }
      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "resume/email/"
          + id                  = (known after apply)
          + lambda_function_arn = "arn:aws:lambda:us-east-1:446872271111:function:levio-demo-fev-attachment-saver-dev"
        }
      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "resume/transcription/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.attachment_saver.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-attachment-saver-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/attachment_saver@sha256:cc7d369c910e0754b221ecdb4db0fe766a557d1a0a0c676157a125b2a0381061" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/attachment_saver@sha256:2328f70c6cbb5387283570a62b648ee46cace16f49be8e03c7a73955a99f90eb"
      ~ last_modified                  = "2024-03-15T15:36:36.872+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.email_request_preprocessor.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-request-preprocessor-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_preprocessor@sha256:0a517a1e95c443b09ffe1281aab695df0959bf1c65a172c32776cf8fea2b2e52" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_preprocessor@sha256:2b07592a75c0ad774d1840c607054bf0ee06e92d1dd1a9a66d3c3c1b92bb70ea"
      ~ last_modified                  = "2024-03-15T15:36:08.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-request-processor-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_processor@sha256:55322280f1cd12863ce13daec7262342a51b0e32d9b5035776723799f339b6b9" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_processor@sha256:c2cd976cf49036766b5e2f879827f47234dbe574ea94311a8bdf2f0e508a648f"
      ~ last_modified                  = "2024-03-15T15:36:39.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "API_KEY"   = (sensitive value)
              - "API_URL"   = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/dev/inference"
              - "QUEUE_URL" = "https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-response-processor-queue-dev.fifo"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::446872271111:policy/levio-demo-fev-email-response-processor-dev-role-inline"
        name      = "levio-demo-fev-email-response-processor-dev-role-inline"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "logs:PutLogEvents",
                            "logs:CreateLogStream",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-email-response-processor-dev/*:*"
                        Sid      = "logwrite"
                    },
                  ~ {
                      ~ Action   = [
                          - "ses:SendEmail",
                          - "ses:SendRawEmail",
                          + "s3:List*",
                          + "s3:Get*",
                          + "s3:Describe*",
                          + "s3-object-lambda:List*",
                          + "s3-object-lambda:Get*",
                        ]
                      ~ Resource = "arn:aws:ses:us-east-1:446872271111:*" -> [
                          + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev/*",
                          + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev",
                        ]
                      ~ Sid      = "ses" -> "s3"
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action   = [
                          + "ses:SendRawEmail",
                          + "ses:SendEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ses:us-east-1:446872271111:*"
                      + Sid      = "ses"
                    },
                    {
                        Action   = [
                            "sqs:ReceiveMessage",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sqs:us-east-1:446872271111:levio-demo-fev-email-response-processor-queue-dev.fifo"
                        Sid      = "sqs"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-response-processor-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_response_processor@sha256:6dbac00a22414b437d936e687171f796c7a7abf14fc9a39b8f506de881744054" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_response_processor@sha256:b85d9ebf42475aca36ff7c88f542aecf612d3993d6db5fda824ee361bfeb6789"
      ~ last_modified                  = "2024-03-13T14:29:12.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:de99051bf5a8455b1940d2d92868ef7d1492f6a461b10cf348032f777918136e" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:ea744cb2e91a9188cb61957ffd76a7f2942aaef81e05333cc23efe8c73cbb95f"
      ~ last_modified                  = "2024-03-15T15:36:09.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-ingestion-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:a98262a03848b81a39e3890309f7e4c2f426c1db617bfc4514fdc79bd8948aba" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:5c7e4ac3734152e6270cd29eb1c623dd2c601589c62b74098cb5549ec8c2536c"
      ~ last_modified                  = "2024-03-15T15:36:09.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-lex-router-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:be239a58d1a824e0d12f6e73f7437f3eef290cc4f18d99a1a6667c3d72643e82" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:036958f9227b10509708f65e8056563d75c5dd8674aafd2670a74d79bdb60a56"
      ~ last_modified                  = "2024-03-15T15:36:08.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-list-collections-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:2e66309c45e0bdf2bca629c3c60a2b5e9ecf3eeff361ce08cbec344b7ccedd43" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:48ac111f59ee85c678a2fefa71a5401163727a9b9b8c569973307be2f5d51dd4"
      ~ last_modified                  = "2024-03-15T15:36:09.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.memory.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-memory-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:a7cf029d6f4f39bb48eb5570e94acf71842d22f56242b6eb6221d7b3500d997e" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:64d944cb689926e9bf269bb2710778a7daf0dfd247313158f1c02567aa589a37"
      ~ last_modified                  = "2024-03-15T15:36:08.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.resume.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-resume-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/resume@sha256:846b2f8f46eb849debb3a38c510a2c4587ceee5d3480401d92c648157d6f9d3c" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/resume@sha256:585efa84b5f4dc9082a7fb997f40c867a33ac9fd7ce256505643d40cdfd36687"
      ~ last_modified                  = "2024-03-15T15:36:17.602+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "loggroup"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-resume-request-preprocessor-dev/*:*",
            ]
          + sid       = "logwrite"
        }
      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
          + sid       = "requestsqs"
        }
      + statement {
          + actions   = [
              + "s3-object-lambda:Get*",
              + "s3-object-lambda:List*",
              + "s3-object-lambda:WriteGetObjectResponse",
              + "s3:Describe*",
              + "s3:Get*",
              + "s3:List*",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev",
              + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev/*",
            ]
          + sid       = "s3"
        }
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-resume-request-preprocessor-dev-role-inline"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-resume-request-preprocessor-dev-role"
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "levio-demo-fev-resume-request-preprocessor-dev"
      + id                             = (known after apply)
      + image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/resume_request_preprocessor@sha256:37023604466b619df3221f0e90e9b33583b374c99bfe9ee15a61d86bc2fdb864"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::446872271111:role/levio-demo-fev-resume-request-preprocessor-dev-role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

  # module.resume_request_preprocessor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["s3"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "levio-demo-fev-resume-request-preprocessor-dev"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev"
      + statement_id        = "s3"
      + statement_id_prefix = (known after apply)
    }

  # module.resume_request_processor.module.fifo_sqs.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "levio-demo-fev-resume-request-processor-queue-dev.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 60
    }

  # module.resume_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:us-east-1:446872271111:function:levio-demo-fev-resume-dev",
            ]
          + sid       = "lambda"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "loggroup"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-resume-request-processor-dev/*:*",
            ]
          + sid       = "logwrite"
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
          + sid       = "requestsqs"
        }
      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:446872271111:levio-demo-fev-email-response-processor-queue-dev.fifo",
            ]
          + sid       = "responsesqs"
        }
      + statement {
          + actions   = [
              + "s3-object-lambda:Get*",
              + "s3-object-lambda:List*",
              + "s3-object-lambda:WriteGetObjectResponse",
              + "s3:Describe*",
              + "s3:Get*",
              + "s3:List*",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev",
              + "arn:aws:s3:::levio-demo-fev-esta-ses-bucket-dev/*",
            ]
          + sid       = "s3"
        }
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-resume-request-processor-dev-role-inline"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-resume-request-processor-dev-role"
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"] will be created
  + resource "aws_lambda_event_source_mapping" "this" {
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "levio-demo-fev-resume-request-processor-dev"
      + id                             = (known after apply)
      + image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/resume_request_processor@sha256:22f4583dc63dd50b3ae4234438fe8ce11e1a28593f49440f6e5c20b624c2298f"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::446872271111:role/levio-demo-fev-resume-request-processor-dev-role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME"     = "levio-demo-fev-esta-ses-bucket-dev"
              + "DIALOGUE_PROMPT" = "Refais ce texte sous forme de dialogues entre un intervenant et ses clients: "
              + "FUNCTION_NAME"   = "levio-demo-fev-resume-dev"
              + "QUEUE_URL"       = "https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-response-processor-queue-dev.fifo"
              + "RESUME_PROMPT"   = "Tu es un travailleur social. Fais une analyse de ce texte. Ne résume pas trop, permets toi d'avoir du contenu pour soutenir ta réponse"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

  # module.resume_request_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "levio-demo-fev-resume-request-processor-dev"
      + id                  = (known after apply)
      + principal           = "sqs.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "sqs"
      + statement_id_prefix = (known after apply)
    }

  # module.transcription_processor.module.lambda_function_container_image.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ Service = [
                              - "lambda.amazonaws.com",
                                "transcribe.amazonaws.com",
                              + "lambda.amazonaws.com",
                              + "lambda.amazonaws.com",
                            ]
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "levio-demo-fev-transcription-processor-dev-role"
        name                  = "levio-demo-fev-transcription-processor-dev-role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.transcription_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-transcription-processor-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/transcription_processor@sha256:f8467e50a928e11ff5649e3a230ea58e1c44328f533867516e172b3ffa534f79" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/transcription_processor@sha256:0a4a065d4bc630fd55ebfe1049f72a267d538c02d6282b65af9338bac2f5ffb3"
      ~ last_modified                  = "2024-03-15T15:36:30.874+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 12 to add, 14 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.tfplan"

```

</details>

*Pusher: @brunoabreu-levio, Action: `pull_request`, Workflow: `Deploy Lambdas & Terraform Plan on PR`*